{
    "text": {
        "text": "Sistemas desenvolvidos para a plataforma web utilizam a linguagem HTML para a exibição de conteúdo, tanto para páginas estáticas como dinâmicas. Com HTML5 é possível criar páginas web com diversos recursos para a apresentação de dados por meio de novas marcações que permitem o uso de semântica e acessibilidade, facilitando a pesquisa por motores de busca automática e dispositivos próprios para deficientes visuais e auditivos.\r\n\r\nNesta Unidade de Aprendizagem, você vai estudar a estrutura de páginas web, a formatação de texto em documentos hipertexto e a apresentação de links, listas e tabelas em HTML5.\r\n\r\nBons estudos.\r\n\r\nAo final desta Unidade de Aprendizagem, você deve apresentar os seguintes aprendizados:\r\nDefinir a estrutura de uma página web com HTML5.\r\nAplicar formatação de texto em uma página web com HTML5.\r\nDesenvolver listas e tabelas em uma página web com HTML5.",
        "type": "text"
    },
    "pdf": {
        "text": "DESENVOLVIMENTO \nDE SISTEMAS PHP \nMaurício de Oliveira Saraiva \nCriação de páginas web \ncom HTML5\nObjetivos de aprendizagem\nAo final deste texto, você deve apresentar os seguintes aprendizados:\n\n Definir a estrutura de uma página web com HTML5.\n\n Aplicar a formatação de texto em uma página web com HTML5.\n\n Desenvolver listas e tabelas em uma página web com HTML5.\nIntrodução\nSistemas desenvolvidos para a plataforma web, tanto para páginas es­\ntáticas como dinâmicas, utilizam a linguagem HTML para a exibição \ndo conteúdo. Com HTML5, é possível criar páginas web com diversos \nrecursos para a apresentação de dados, por meio de novas marcações \nque permitem o uso de semântica e acessibilidade. Isso facilita a pesquisa \npor motores de busca automática, dispositivos próprios para deficientes \nvisuais e auditivos, entre outros.\nNeste capítulo, você vai estudar a estrutura de páginas web, a for­\nmatação de texto em documentos hipertexto e apresentação de links, \nlistas e tabelas em HTML5.\nEstrutura de uma página web com HTML5\nHTML, do inglês hyper text markup language, ou linguagem de marcação \nde hipertexto, é uma linguagem utilizada para criar documentos para a web. \nEsses documentos, que também são chamados de páginas, podem conter \nmarcações que permitem visualizar e acessar conteúdos web em geral, como \ntextos, imagens, áudios e vídeos entre outros (SILVA, 2015).\nA versão 5 do HTML, ou simplesmente HTML5, foi publicada em 2014 \npelo World Wide Web Consortium (W3C). W3C é uma comunidade interna­\ncional que possui diversos participantes colaborando para o desenvolvimento \nde padrões da web, como as especificações HTML, XML, CSS, etc. (CON­\nSÓRCIO..., c2011).\nSaiba mais sobre o W3C e as especificações mantidas \npela comunidade acessando o endereço a seguir \n(CONSÓRCIO…, c2011).\nhttps://goo.gl/VHQ5n\nA exibição de uma página HTML pode ser feita por um programa de \ncomputador chamado navegador web ou simplesmente navegador ou ­\nbrowser. \nExistem diversos navegadores disponíveis no mercado, como Chrome, \n­\nInternet Explorer, Firefox, Safari, Opera, Edge, entre outros. No entanto, é \npreciso ter cuidado com as marcações inseridas nas páginas, uma vez que, \ndevido às diversas versões existentes dos navegadores, alguns conteúdos \npodem não ser exibidos corretamente, caso o navegador do usuário esteja \ndesatualizado.\nAs marcações de uma página HTML representam mais que a apresentação \nvisual do conteúdo. Ao acessar um conteúdo web, você consegue identificar os \nelementos visualmente, pela sua formatação, como títulos em letras maiores, \ndados de cabeçalho e rodapé, idioma, áreas da página e outros.\nContudo, a informação na web não é acessada apenas por pessoas, já que \no conteúdo pode ser lido por diversos meios, como motores de busca automá­\ntica, dispositivos próprios para deficientes visuais e auditivos, equipamentos\nportáteis com diferentes tamanhos de tela, etc. (EIS; FERREIRA, 2012).\nCom base nisso, no HTML5 foram incluídos alguns elementos que \npermitem a leitura e a interpretação da estrutura de uma página web de \nforma organizada e segura. Essa organização é definida por elementos \nsemânticos, que dão significado aos objetos de uma página, conforme \nvocê verá a seguir.\nCriação de páginas web com HTML5\n2\nPrincipais elementos da estrutura de uma página HTML5\nComo dito anteriormente, uma página HTML é composta por marcações. Essas \nmarcações estão inseridas no documento dentro de itens específicos chamados \nde tags, etiquetas ou elementos, que respeitam uma estrutura hierárquica bem \ndefinida. A Figura 1 apresenta essa estrutura.\nFigura 1. Estrutura básica de uma página HTML5.\nDoctype\nA instrução DOCTYPE, apresentada na linha 1, é um comando especial que \nindica ao navegador a versão do documento HTML. Nas versões anteriores ao \nHTML5, era necessário informar o número da versão, contudo, na versão 5, \nisso não é mais necessário, bastando informar <!DOCTYPE html> para que \nos navegadores a interpretem como uma página HTML5.\nHtml\nA tag <html>, indicada na linha 2, representa a marcação de nível mais \nelevado de uma página HTML. Essa tag envolve outras tags que pertencem \nà estrutura básica de um documento HTML, como <head> e <body>, que \nserão apresentadas na sequência. Essas tags devem ser “fechadas” com suas \nrespectivas tags de encerramento: </head>, </body> e </html>, conforme \nilustrado nas linhas 6, 8 e 9, respectivamente.\nHead\nO conteúdo pertencente à tag <head>, expresso entre as linhas 3 e 6, deve \nconter informações que são interpretadas pelo navegador, como o título <ti­\ntle>, a codificação do idioma <meta> e a inclusão de arquivos CSS <link>.\n3\nCriação de páginas web com HTML5\nTitle\nA tag <title>, ilustrada na linha 4, serve para indicar o título da página\nque será apresentado na barra de título ou na aba documento do navegador. \nJá a tag <meta>, indicada na linha 5, serve para configurar o idioma de\napresentação de caracteres da página. Nesse caso, charset= “utf-8” \nindica que o navegador deve exibir os caracteres do idioma português, como \ncedilha e acentos.\nA linguagem HTML não é case sensitive, como a linguagens C e Java que diferen­\nciam letras maiúsculas de minúsculas. Isso significa que não faz diferença escrever \nas tags em maiúsculo ou minúsculo, desde que os comandos estejam corretos. No \nentanto, alguns comandos são escritos de determinada forma por padrão de escrita. \nAlém disso, tanto faz identificar as instruções com aspas simples ou duplas, uma vez \nque os navegadores estão preparados para interpretar os dois modos, por exemplo, \ncharset= “utf-8” ou charset= ‘utf-8’.\nBody\nA tag <body> engloba o corpo do documento HTML, ou seja, é dentro dessa \ntag que você deve inserir todo o conteúdo da página que será exibido pelo \nnavegador. No HTML5, a tag <body> ganhou seis novas tags, incluídas para \norganizar e permitir pesquisas semânticas mais eficientes por sistemas de busca \nautomatizados: <section>, <header>, <aside>, <nav>, <article> e\n<footer>, conforme apresentado na Figura 2.\nFigura 2. Estrutura da tag <body> no HTML5.\nCriação de páginas web com HTML5\n4\nSection\nO elemento <section> define uma seção ou área da página. Esse elemento \nsubstitui grande parte das tags <div> e <span> que eram usadas de ma­\nneira genérica para a mesma finalidade no HTML4 ou anterior. Uma página \nHTML5 pode conter várias seções, que podem representar as mais diversas \náreas de um site.\nArticle\nO conteúdo principal de uma página HTML5 deve estar localizado dentro \nda tag <article>. Essa tag representa um bloco que contém o conteúdo \nprincipal do site, como texto, redação e demais informações.\nHeader e footer\nAs tags <header> e <footer> representam os cabeçalhos e rodapés, res­\npectivamente. Essas tags podem pertencer a mais de uma área, como seções \nou a própria página principal. Os cabeçalhos armazenam informações que se \nlocalizam no topo da página ou das seções e os rodapés contém dados que se \nencontram no final da página ou das seções.\nNav e aside\nUma área de links pode ser delimitada pelo elemento <nav>, que especifica \natalhos para o próprio documento ou para outras páginas. Já a tag <aside> \nindica uma área que não pertence ao fluxo principal, como um anúncio, por \nexemplo.\nFormatação de texto de uma página web com \nHTML5\nA especificação HTML5 disponibiliza uma série de elementos para formatar \ntextos e criar links e âncoras em páginas web. Para realizar isso você deve \nusar tags específicas que permitem formatar os elementos de forma padrão, \nvisando equilibrar o código com a semântica do HTML5.\n5\nCriação de páginas web com HTML5\nFormatação de texto\nUma página web exibe seu conteúdo texto diferente da forma como é es­\ncrito no código-fonte HTML. Essa diferença se dá porque seu conteúdo \nrequer marcações específicas nos objetos para realizar a formatação, ou \nseja, é preciso que você insira tags para definir a forma como os textos \nsão apresentados.\nParágrafo\nO elemento <p> indica a marcação de um parágrafo no texto, inserindo, \nautomaticamente, uma quebra de linha ao final quando localiza a tag </p>, \nque indica o fechamento do parágrafo. Sem esses elementos, qualquer texto \nem uma página HTML será escrito em sequência, mesmo que você insira \nquebras de linha no código-fonte pressionando a tecla enter. Veja a aplicação \nde parágrafos na Figura 3.\nFigura 3. Parágrafos.\nA tag <br /> cria uma quebra de linha no texto, forçando a continuação \ndo texto na próxima linha. Esse comando pode ser observado na linha 2.\nO elemento <pre> define que o texto será apresentado no navegador tal \nqual está digitado no código-fonte HTML, respeitando os espaços em branco \ne as quebras de linhas. Note como os espaços presentes no início do parágrafo \n(linhas 5 e 7) do texto que está formatado com a tag <pre> são respeitados \npelo navegador.\nNa Figura 4 você pode ver um exemplo da exibição de parágrafos no \nnavegador.\nCriação de páginas web com HTML5\n6\nFigura 4. Exibição dos parágrafos no navegador.\nTítulos\nExistem seis níveis de títulos que definem o tamanho do texto. Esses níveis \nsão definidos pelos elementos <h1>, <h2>, <h3>, <h4>, <h5> e <h6>, que \nformatam o texto desde um tamanho maior até um tamanho menor, conforme \nrepresentado nas Figuras 5 e 6. \nFigura 5. Títulos em HTML.\nFigura 6. Exibição de títulos no navegador.\n7\nCriação de páginas web com HTML5\nEstilos de texto\nEstilos como negrito, itálico, excluído, inserido, marcado, sobrescrito e subs­\ncrito podem ser aplicados para formatar o texto, conforme você pode observar \nnas Figuras 7 e 8. Esses estilos permitem aplicar ou retirar a ênfase de partes \ndo conteúdo, de modo que o navegador consiga interpretar o destaque aplicado, \nindependentemente do dispositivo e de sua configuração de tamanho de tela \n(FLATSCHART, 2011).\nFigura 7. Estilos de texto.\nFigura 8. Estilos exibidos no navegador.\nCriação de páginas web com HTML5\n8\nConfira mais elementos de formatação de texto em \nHTML5 no endereço a seguir (RIBEIRO, c2017).\nhttps://goo.gl/AJwyQV\nFolhas de estilo, links e âncoras\nEm páginas HTML, os links ou hiperlinks são importantes para carregar \narquivos externos e fazer direcionamentos para outras páginas ou para pontos \ndentro da própria página. Portanto, os links são usados para direcionar para \nalgum lugar ou buscar alguma informação.\nFolhas de estilo\nUma página HTML pode carregar arquivos CSS, do inglês cascading style \nsheets, ou folhas de estilo em cascata, que são usados para definir as folhas \nde estilo das páginas, como cores, fontes, espaçamentos, etc. A definição do \narquivo de folhas de estilo se dá pela tag <link>.\n<link href=”estilo.css” rel=”stylesheet”>\nO atributo rel=“stylesheet” indica o que o arquivo é do tipo folhas de \nestilo e o atributo href=“estilo.css” representa o nome e o caminho do \narquivo que será carregado na página. Se o caminho não for informado junto \nao nome do arquivo, o navegador interpretará que o arquivo está no mesmo \ndiretório da página HTML.\nLinks\nUm link é uma espécie de atalho que você pode colocar em um elemento \n(palavra, frase, imagem, etc.) e que aponta ou direciona para algum objeto \nna web, como uma página, uma figura, um vídeo ou qualquer endereço de \ninternet. Veja um exemplo na Figura 9.\n9\nCriação de páginas web com HTML5\nFigura 9. Link.\nA linha 1 define o endereço da tag <a> que a guia atual do navegador irá\ncarregar no caso de uma ação de clique no link; a linha 2 estabelece a men­\nsagem que será exibida pelo link no navegador; e a linha 3 faz o fechamento \ndo elemento link, encerrando o comando.\nDevemos usar caminho com URL completa quando fazemos links para páginas \nexternas ao nosso site, como no caso de um link para o site do Governo Federal do \nBrasil. Deve-se usar, contudo, o caminho relativo, nos casos em que o endereço se \nrefere ao nosso próprio site, como um link para uma página que exibe a relação de \nclientes cadastrados: \nCaminho com URL completa:\n\n <a href= “http://www.brasil.gov.br”>\nCaminho relativo:\n\n <a href= “/cliente/lista_cliente.php”>\nOs links definidos pela tag <a> possuem atributos opcionais que definem\no seu comportamento ou incluem informações adicionais. Os atributos mais\nconhecidos são title, download, target e mailto.\nTitle\nExibe uma mensagem como dica quando você posicionar o mouse sobre o \nlink. Esse atributo serve para instruir os usuários sobre o conteúdo do link.\n<a href=”http:/\n/www.brasil.gov.br” title=”Site oficial \ndo Brasil”>Brasil</a>\nCriação de páginas web com HTML5\n10\nDownload\nForça o download automático do arquivo que está referenciado no link. Apesar \nde forçar o download, permite que o usuário troque o nome do arquivo no \nmomento de baixa-lo. Além disso, o comando permite que você sugira um \nnovo nome para o arquivo, que pode ser diferente do seu nome original.\n<a href= “relatorio _ vendas.docx” download= “rela­\ntorio.docx”>Download</a>\nNesse caso, o nome original do arquivo é relatorio_vendas.docx, mas a \npágina HTML irá sugerir o nome relatorio.docx para o usuário, no momento \ndownload.\nTarget\nNo caso de um link para uma página HTML, o atributo target define se \nessa página será aberta na mesma aba ou em uma nova aba do navegador. \nO atributo _ self define na mesma aba ou janela, já o atributo _ blank \nestabelece uma nova aba ou janela.\n< href= \n“relatório _ vendas.docx” \ntarget= \n“ _ self”>Donwload</a>\nE-mail\nÉ possível criar um link para abrir programas de e-mail com alguns campos \njá preenchidos, como o endereço do destinatário e o assunto. É importante \ndestacar que esse comando apenas surtirá efeito se o usuário utilizar programas \nclientes de e-mail, como o Outlook.\n<a \nhref= \n“mailto:endereco@dominio.com.\nbr?subject=assunto da mensagem”>Enviar e-mail</a>\nÂncoras\nÂncoras são utilizadas para realizar o direcionamento para determinado local \ndentro de uma mesma página HTML. Normalmente, esse recurso é utilizado \nquando uma página possui vários links no topo e um vasto conteúdo restante \nabaixo. Dessa forma, é possível acessar determinado conteúdo diretamente, \nsem ter que passar por conteúdos que não são interessantes naquele momento \n(FREEMAN; ROBSON, 2014).\n11\nCriação de páginas web com HTML5\nUma página pode conter várias âncoras e em qualquer parte do documento. \nIsso permite que você coloque âncoras que direcionem de volta ao topo da \npágina, após ler determinado conteúdo que já havia sido direcionado por \noutra âncora.\nPara criar uma âncora, você deve escrever dois comandos em uma página \nHTML: o primeiro é o posicionamento de um apelido em um local desejado \ndo documento, por meio da tag <a name>; e o segundo comando define um\natalho para o apelido que foi criado, representado pela tag <a href>, como\nvocê pode ver na Figura 10.\nFigura 10. Âncora.\nAo clicar no atalho da linha 4, você será posicionado automaticamente \nnos poemas de Cecília Meireles, sem ter que passar pelos poemas de Érico \nVeríssimo e outros autores. Isso corre porque esse atalho aponta para o apelido \ncecilia_meireles, indicado na linha 11. Além disso, após ler os poemas de \nCecília Meireles, você poderá voltar ao topo da página rapidamente, por meio \ndo atalho topo localizado na linha 14.\nListas e tabelas de uma página web com HTML5\nListas\nUma lista em HTML equivale a um conjunto de elementos dispostos com \nmarcadores em uma página. Essa disposição facilita a visualização de itens, \nCriação de páginas web com HTML5\n12\npor exemplo, uma relação de ingredientes de uma receita de culinária ou itens \nde um sumário.\nExistem três tipos de listas definidos na especificação HTML5: listas \nnão ordenadas, listas ordenadas e listas de definição. Essas listas podem ser \naninhadas em sublistas, inclusive com tipos diferentes (FLATSCHART, 2011).\nLista não ordenada\nUma lista não ordenada, ilustrada na Figura 11, representa uma relação \nde itens com mesmo grau de importância, isto é, não existe uma ordem de \nprioridade, pois os marcadores dos itens dessa lista são iguais para todos \nos elementos. A tag da lista não ordenada é <ul> e cada item da lista é\nindicado pela tag <li>.\nFigura 11. Lista não ordenada.\nNa Figura 12, você pode observar uma lista não ordenada no navegador.\nFigura 12. Exibição de lista não ordenada no navegador.\n13\nCriação de páginas web com HTML5\nLista ordenada\nUma lista ordenada representa uma relação de itens identificados por uma \nordem numérica, isto é, existe uma relação de prioridade, pois os marcadores \ndos itens dessa lista estão dispostos em uma sequência. A tag da lista ordenada \né <ol> e cada item da lista também é indicado pela tag <li>. Veja nas Figuras\n13 e 14 as representações de uma lista ordenada.\nFigura 13. Lista ordenada.\nFigura 14. Exibição de lista ordenada no navegador.\nLista de definição\nUma lista de definição representa uma relação de itens ligados a subitens, \ncomo uma espécie de glossário, porém sem apresentar qualquer marcador. A \ntag da lista de definição é <dl>, cada item da lista é indicado pela tag <dt>\ne seus respectivos subitens são representados pela tag <dd>. Observe as\napresentações de uma lista de definição nas Figura 15 e 16.\nCriação de páginas web com HTML5\n14\nFigura 15. Lista de definição.\nFigura 16. Exibição de lista de definição no navegador.\nTabelas\nTabelas são utilizadas para exibir um conteúdo tabulado em uma página \nHTML, ou seja, uma tabela formata e apresenta os elementos dispostos em \nlinhas e colunas. Para criar uma tabela você deve usar a tag <table>, seguida \ndas tags que indicam a formação de linha <tr> e coluna <th> e <td> (th\né usado para as colunas do cabeçalho e td, para as demais colunas da tabela) \n(SILVA, 2015).\nTags agrupadoras definem áreas de cabeçalho <thead>, rodapé <tfoot>\ne corpo da tabela <tbody>. Essas tags oferecem a vantagem de organizar e\nseparar as áreas da tabela que podem ser apresentadas de modos diferentes, \n15\nCriação de páginas web com HTML5\nconforme as folhas de estilo utilizadas, além de permitir que os navegadores \nrepitam os cabeçalhos quando são impressas tabelas com muitas páginas. Veja \nos exemplos das Figura 17 e 18.\nFigura 17. Tabela em HTML5.\nFigura 18. Tabela apresentada no navegador.\nCriação de páginas web com HTML5\n16\nO exemplo ilustrado apresenta os preços fictícios de alguns veículos em \nforma de tabela de preços. Nesse exemplo, você pode encontrar os principais \nitens de uma tabela, como linhas e colunas e os elementos de estrutura de \ntabelas, como cabeçalho, rodapé e corpo.\nNote que os elementos da estrutura da tabela não precisam, necessariamente, \nestar dispostos em ordem, pois nesse exemplo os itens do rodapé (linhas 6 a \n9) estão inseridos antes do corpo da tabela (linhas 12 a 23) no código-fonte.\nIsso significa que o navegador faz a interpretação dos elementos da tabela e\nos apresenta de forma correta, independentemente da ordem em que foram\nescritos.\nO atributo opcional border (linha 1) define a largura da borda da tabela. Se \nesse atributo for omitido, a tabela será exibida sem bordas, mantendo apenas \na formatação do posicionamento dos elementos. Além desse atributo, outros \ndois podem ser inseridos nas tags <tr> e <td | th>: rowspan e colspan,\nque mesclam linhas e colunas, respectivamente.\nCONSÓRCIO World Wide Web. São Paulo: W3C, c2011. Disponível em: <http://www.\nw3c.br/Home/WebHome>. Acesso em: 30 out. 2017.\nEIS, D.; FERREIRA, E. HTML5 e CSS3: com farinha e pimenta. São Paulo: Lulu.com, 2012.\nFLATSCHART, F. HTML5: embarque imediato. Rio de Janeiro: Brasport, 2011.\nFREEMAN, E.; ROBSON, E. Use a cabeça! Programação em HTML 5. Rio de Janeiro: Alta \nBooks, 2014.\nRIBEIRO, R. Comandos e tags HTML5. Rio de Janeiro: DevMedia, c2017. Disponível em: \n<https://www.devmedia.com.br/comandos-e-tags-html5/23618>. Acesso em: 26 \nnov. 2017.\nSILVA, M. S. Fundamentos de HTML5 e CSS3. São Paulo: Novatec, 2015.\n17\nCriação de páginas web com HTML5\nEncerra aqui o trecho do livro disponibilizado para \nesta Unidade de Aprendizagem. Na Biblioteca Virtual \nda Instituição, você encontra a obra na íntegra. \n",
        "pages_text": [
            "DESENVOLVIMENTO \nDE SISTEMAS PHP \nMaurício de Oliveira Saraiva \n",
            "Criação de páginas web \ncom HTML5\nObjetivos de aprendizagem\nAo final deste texto, você deve apresentar os seguintes aprendizados:\n\n Definir a estrutura de uma página web com HTML5.\n\n Aplicar a formatação de texto em uma página web com HTML5.\n\n Desenvolver listas e tabelas em uma página web com HTML5.\nIntrodução\nSistemas desenvolvidos para a plataforma web, tanto para páginas es­\ntáticas como dinâmicas, utilizam a linguagem HTML para a exibição \ndo conteúdo. Com HTML5, é possível criar páginas web com diversos \nrecursos para a apresentação de dados, por meio de novas marcações \nque permitem o uso de semântica e acessibilidade. Isso facilita a pesquisa \npor motores de busca automática, dispositivos próprios para deficientes \nvisuais e auditivos, entre outros.\nNeste capítulo, você vai estudar a estrutura de páginas web, a for­\nmatação de texto em documentos hipertexto e apresentação de links, \nlistas e tabelas em HTML5.\nEstrutura de uma página web com HTML5\nHTML, do inglês hyper text markup language, ou linguagem de marcação \nde hipertexto, é uma linguagem utilizada para criar documentos para a web. \nEsses documentos, que também são chamados de páginas, podem conter \nmarcações que permitem visualizar e acessar conteúdos web em geral, como \ntextos, imagens, áudios e vídeos entre outros (SILVA, 2015).\nA versão 5 do HTML, ou simplesmente HTML5, foi publicada em 2014 \npelo World Wide Web Consortium (W3C). W3C é uma comunidade interna­\ncional que possui diversos participantes colaborando para o desenvolvimento \n",
            "de padrões da web, como as especificações HTML, XML, CSS, etc. (CON­\nSÓRCIO..., c2011).\nSaiba mais sobre o W3C e as especificações mantidas \npela comunidade acessando o endereço a seguir \n(CONSÓRCIO…, c2011).\nhttps://goo.gl/VHQ5n\nA exibição de uma página HTML pode ser feita por um programa de \ncomputador chamado navegador web ou simplesmente navegador ou ­\nbrowser. \nExistem diversos navegadores disponíveis no mercado, como Chrome, \n­\nInternet Explorer, Firefox, Safari, Opera, Edge, entre outros. No entanto, é \npreciso ter cuidado com as marcações inseridas nas páginas, uma vez que, \ndevido às diversas versões existentes dos navegadores, alguns conteúdos \npodem não ser exibidos corretamente, caso o navegador do usuário esteja \ndesatualizado.\nAs marcações de uma página HTML representam mais que a apresentação \nvisual do conteúdo. Ao acessar um conteúdo web, você consegue identificar os \nelementos visualmente, pela sua formatação, como títulos em letras maiores, \ndados de cabeçalho e rodapé, idioma, áreas da página e outros.\nContudo, a informação na web não é acessada apenas por pessoas, já que \no conteúdo pode ser lido por diversos meios, como motores de busca automá­\ntica, dispositivos próprios para deficientes visuais e auditivos, equipamentos\nportáteis com diferentes tamanhos de tela, etc. (EIS; FERREIRA, 2012).\nCom base nisso, no HTML5 foram incluídos alguns elementos que \npermitem a leitura e a interpretação da estrutura de uma página web de \nforma organizada e segura. Essa organização é definida por elementos \nsemânticos, que dão significado aos objetos de uma página, conforme \nvocê verá a seguir.\nCriação de páginas web com HTML5\n2\n",
            "Principais elementos da estrutura de uma página HTML5\nComo dito anteriormente, uma página HTML é composta por marcações. Essas \nmarcações estão inseridas no documento dentro de itens específicos chamados \nde tags, etiquetas ou elementos, que respeitam uma estrutura hierárquica bem \ndefinida. A Figura 1 apresenta essa estrutura.\nFigura 1. Estrutura básica de uma página HTML5.\nDoctype\nA instrução DOCTYPE, apresentada na linha 1, é um comando especial que \nindica ao navegador a versão do documento HTML. Nas versões anteriores ao \nHTML5, era necessário informar o número da versão, contudo, na versão 5, \nisso não é mais necessário, bastando informar <!DOCTYPE html> para que \nos navegadores a interpretem como uma página HTML5.\nHtml\nA tag <html>, indicada na linha 2, representa a marcação de nível mais \nelevado de uma página HTML. Essa tag envolve outras tags que pertencem \nà estrutura básica de um documento HTML, como <head> e <body>, que \nserão apresentadas na sequência. Essas tags devem ser “fechadas” com suas \nrespectivas tags de encerramento: </head>, </body> e </html>, conforme \nilustrado nas linhas 6, 8 e 9, respectivamente.\nHead\nO conteúdo pertencente à tag <head>, expresso entre as linhas 3 e 6, deve \nconter informações que são interpretadas pelo navegador, como o título <ti­\ntle>, a codificação do idioma <meta> e a inclusão de arquivos CSS <link>.\n3\nCriação de páginas web com HTML5\n",
            "Title\nA tag <title>, ilustrada na linha 4, serve para indicar o título da página\nque será apresentado na barra de título ou na aba documento do navegador. \nJá a tag <meta>, indicada na linha 5, serve para configurar o idioma de\napresentação de caracteres da página. Nesse caso, charset= “utf-8” \nindica que o navegador deve exibir os caracteres do idioma português, como \ncedilha e acentos.\nA linguagem HTML não é case sensitive, como a linguagens C e Java que diferen­\nciam letras maiúsculas de minúsculas. Isso significa que não faz diferença escrever \nas tags em maiúsculo ou minúsculo, desde que os comandos estejam corretos. No \nentanto, alguns comandos são escritos de determinada forma por padrão de escrita. \nAlém disso, tanto faz identificar as instruções com aspas simples ou duplas, uma vez \nque os navegadores estão preparados para interpretar os dois modos, por exemplo, \ncharset= “utf-8” ou charset= ‘utf-8’.\nBody\nA tag <body> engloba o corpo do documento HTML, ou seja, é dentro dessa \ntag que você deve inserir todo o conteúdo da página que será exibido pelo \nnavegador. No HTML5, a tag <body> ganhou seis novas tags, incluídas para \norganizar e permitir pesquisas semânticas mais eficientes por sistemas de busca \nautomatizados: <section>, <header>, <aside>, <nav>, <article> e\n<footer>, conforme apresentado na Figura 2.\nFigura 2. Estrutura da tag <body> no HTML5.\nCriação de páginas web com HTML5\n4\n",
            "Section\nO elemento <section> define uma seção ou área da página. Esse elemento \nsubstitui grande parte das tags <div> e <span> que eram usadas de ma­\nneira genérica para a mesma finalidade no HTML4 ou anterior. Uma página \nHTML5 pode conter várias seções, que podem representar as mais diversas \náreas de um site.\nArticle\nO conteúdo principal de uma página HTML5 deve estar localizado dentro \nda tag <article>. Essa tag representa um bloco que contém o conteúdo \nprincipal do site, como texto, redação e demais informações.\nHeader e footer\nAs tags <header> e <footer> representam os cabeçalhos e rodapés, res­\npectivamente. Essas tags podem pertencer a mais de uma área, como seções \nou a própria página principal. Os cabeçalhos armazenam informações que se \nlocalizam no topo da página ou das seções e os rodapés contém dados que se \nencontram no final da página ou das seções.\nNav e aside\nUma área de links pode ser delimitada pelo elemento <nav>, que especifica \natalhos para o próprio documento ou para outras páginas. Já a tag <aside> \nindica uma área que não pertence ao fluxo principal, como um anúncio, por \nexemplo.\nFormatação de texto de uma página web com \nHTML5\nA especificação HTML5 disponibiliza uma série de elementos para formatar \ntextos e criar links e âncoras em páginas web. Para realizar isso você deve \nusar tags específicas que permitem formatar os elementos de forma padrão, \nvisando equilibrar o código com a semântica do HTML5.\n5\nCriação de páginas web com HTML5\n",
            "Formatação de texto\nUma página web exibe seu conteúdo texto diferente da forma como é es­\ncrito no código-fonte HTML. Essa diferença se dá porque seu conteúdo \nrequer marcações específicas nos objetos para realizar a formatação, ou \nseja, é preciso que você insira tags para definir a forma como os textos \nsão apresentados.\nParágrafo\nO elemento <p> indica a marcação de um parágrafo no texto, inserindo, \nautomaticamente, uma quebra de linha ao final quando localiza a tag </p>, \nque indica o fechamento do parágrafo. Sem esses elementos, qualquer texto \nem uma página HTML será escrito em sequência, mesmo que você insira \nquebras de linha no código-fonte pressionando a tecla enter. Veja a aplicação \nde parágrafos na Figura 3.\nFigura 3. Parágrafos.\nA tag <br /> cria uma quebra de linha no texto, forçando a continuação \ndo texto na próxima linha. Esse comando pode ser observado na linha 2.\nO elemento <pre> define que o texto será apresentado no navegador tal \nqual está digitado no código-fonte HTML, respeitando os espaços em branco \ne as quebras de linhas. Note como os espaços presentes no início do parágrafo \n(linhas 5 e 7) do texto que está formatado com a tag <pre> são respeitados \npelo navegador.\nNa Figura 4 você pode ver um exemplo da exibição de parágrafos no \nnavegador.\nCriação de páginas web com HTML5\n6\n",
            "Figura 4. Exibição dos parágrafos no navegador.\nTítulos\nExistem seis níveis de títulos que definem o tamanho do texto. Esses níveis \nsão definidos pelos elementos <h1>, <h2>, <h3>, <h4>, <h5> e <h6>, que \nformatam o texto desde um tamanho maior até um tamanho menor, conforme \nrepresentado nas Figuras 5 e 6. \nFigura 5. Títulos em HTML.\nFigura 6. Exibição de títulos no navegador.\n7\nCriação de páginas web com HTML5\n",
            "Estilos de texto\nEstilos como negrito, itálico, excluído, inserido, marcado, sobrescrito e subs­\ncrito podem ser aplicados para formatar o texto, conforme você pode observar \nnas Figuras 7 e 8. Esses estilos permitem aplicar ou retirar a ênfase de partes \ndo conteúdo, de modo que o navegador consiga interpretar o destaque aplicado, \nindependentemente do dispositivo e de sua configuração de tamanho de tela \n(FLATSCHART, 2011).\nFigura 7. Estilos de texto.\nFigura 8. Estilos exibidos no navegador.\nCriação de páginas web com HTML5\n8\n",
            "Confira mais elementos de formatação de texto em \nHTML5 no endereço a seguir (RIBEIRO, c2017).\nhttps://goo.gl/AJwyQV\nFolhas de estilo, links e âncoras\nEm páginas HTML, os links ou hiperlinks são importantes para carregar \narquivos externos e fazer direcionamentos para outras páginas ou para pontos \ndentro da própria página. Portanto, os links são usados para direcionar para \nalgum lugar ou buscar alguma informação.\nFolhas de estilo\nUma página HTML pode carregar arquivos CSS, do inglês cascading style \nsheets, ou folhas de estilo em cascata, que são usados para definir as folhas \nde estilo das páginas, como cores, fontes, espaçamentos, etc. A definição do \narquivo de folhas de estilo se dá pela tag <link>.\n<link href=”estilo.css” rel=”stylesheet”>\nO atributo rel=“stylesheet” indica o que o arquivo é do tipo folhas de \nestilo e o atributo href=“estilo.css” representa o nome e o caminho do \narquivo que será carregado na página. Se o caminho não for informado junto \nao nome do arquivo, o navegador interpretará que o arquivo está no mesmo \ndiretório da página HTML.\nLinks\nUm link é uma espécie de atalho que você pode colocar em um elemento \n(palavra, frase, imagem, etc.) e que aponta ou direciona para algum objeto \nna web, como uma página, uma figura, um vídeo ou qualquer endereço de \ninternet. Veja um exemplo na Figura 9.\n9\nCriação de páginas web com HTML5\n",
            "Figura 9. Link.\nA linha 1 define o endereço da tag <a> que a guia atual do navegador irá\ncarregar no caso de uma ação de clique no link; a linha 2 estabelece a men­\nsagem que será exibida pelo link no navegador; e a linha 3 faz o fechamento \ndo elemento link, encerrando o comando.\nDevemos usar caminho com URL completa quando fazemos links para páginas \nexternas ao nosso site, como no caso de um link para o site do Governo Federal do \nBrasil. Deve-se usar, contudo, o caminho relativo, nos casos em que o endereço se \nrefere ao nosso próprio site, como um link para uma página que exibe a relação de \nclientes cadastrados: \nCaminho com URL completa:\n\n <a href= “http://www.brasil.gov.br”>\nCaminho relativo:\n\n <a href= “/cliente/lista_cliente.php”>\nOs links definidos pela tag <a> possuem atributos opcionais que definem\no seu comportamento ou incluem informações adicionais. Os atributos mais\nconhecidos são title, download, target e mailto.\nTitle\nExibe uma mensagem como dica quando você posicionar o mouse sobre o \nlink. Esse atributo serve para instruir os usuários sobre o conteúdo do link.\n<a href=”http:/\n/www.brasil.gov.br” title=”Site oficial \ndo Brasil”>Brasil</a>\nCriação de páginas web com HTML5\n10\n",
            "Download\nForça o download automático do arquivo que está referenciado no link. Apesar \nde forçar o download, permite que o usuário troque o nome do arquivo no \nmomento de baixa-lo. Além disso, o comando permite que você sugira um \nnovo nome para o arquivo, que pode ser diferente do seu nome original.\n<a href= “relatorio _ vendas.docx” download= “rela­\ntorio.docx”>Download</a>\nNesse caso, o nome original do arquivo é relatorio_vendas.docx, mas a \npágina HTML irá sugerir o nome relatorio.docx para o usuário, no momento \ndownload.\nTarget\nNo caso de um link para uma página HTML, o atributo target define se \nessa página será aberta na mesma aba ou em uma nova aba do navegador. \nO atributo _ self define na mesma aba ou janela, já o atributo _ blank \nestabelece uma nova aba ou janela.\n< href= \n“relatório _ vendas.docx” \ntarget= \n“ _ self”>Donwload</a>\nE-mail\nÉ possível criar um link para abrir programas de e-mail com alguns campos \njá preenchidos, como o endereço do destinatário e o assunto. É importante \ndestacar que esse comando apenas surtirá efeito se o usuário utilizar programas \nclientes de e-mail, como o Outlook.\n<a \nhref= \n“mailto:endereco@dominio.com.\nbr?subject=assunto da mensagem”>Enviar e-mail</a>\nÂncoras\nÂncoras são utilizadas para realizar o direcionamento para determinado local \ndentro de uma mesma página HTML. Normalmente, esse recurso é utilizado \nquando uma página possui vários links no topo e um vasto conteúdo restante \nabaixo. Dessa forma, é possível acessar determinado conteúdo diretamente, \nsem ter que passar por conteúdos que não são interessantes naquele momento \n(FREEMAN; ROBSON, 2014).\n11\nCriação de páginas web com HTML5\n",
            "Uma página pode conter várias âncoras e em qualquer parte do documento. \nIsso permite que você coloque âncoras que direcionem de volta ao topo da \npágina, após ler determinado conteúdo que já havia sido direcionado por \noutra âncora.\nPara criar uma âncora, você deve escrever dois comandos em uma página \nHTML: o primeiro é o posicionamento de um apelido em um local desejado \ndo documento, por meio da tag <a name>; e o segundo comando define um\natalho para o apelido que foi criado, representado pela tag <a href>, como\nvocê pode ver na Figura 10.\nFigura 10. Âncora.\nAo clicar no atalho da linha 4, você será posicionado automaticamente \nnos poemas de Cecília Meireles, sem ter que passar pelos poemas de Érico \nVeríssimo e outros autores. Isso corre porque esse atalho aponta para o apelido \ncecilia_meireles, indicado na linha 11. Além disso, após ler os poemas de \nCecília Meireles, você poderá voltar ao topo da página rapidamente, por meio \ndo atalho topo localizado na linha 14.\nListas e tabelas de uma página web com HTML5\nListas\nUma lista em HTML equivale a um conjunto de elementos dispostos com \nmarcadores em uma página. Essa disposição facilita a visualização de itens, \nCriação de páginas web com HTML5\n12\n",
            "por exemplo, uma relação de ingredientes de uma receita de culinária ou itens \nde um sumário.\nExistem três tipos de listas definidos na especificação HTML5: listas \nnão ordenadas, listas ordenadas e listas de definição. Essas listas podem ser \naninhadas em sublistas, inclusive com tipos diferentes (FLATSCHART, 2011).\nLista não ordenada\nUma lista não ordenada, ilustrada na Figura 11, representa uma relação \nde itens com mesmo grau de importância, isto é, não existe uma ordem de \nprioridade, pois os marcadores dos itens dessa lista são iguais para todos \nos elementos. A tag da lista não ordenada é <ul> e cada item da lista é\nindicado pela tag <li>.\nFigura 11. Lista não ordenada.\nNa Figura 12, você pode observar uma lista não ordenada no navegador.\nFigura 12. Exibição de lista não ordenada no navegador.\n13\nCriação de páginas web com HTML5\n",
            "Lista ordenada\nUma lista ordenada representa uma relação de itens identificados por uma \nordem numérica, isto é, existe uma relação de prioridade, pois os marcadores \ndos itens dessa lista estão dispostos em uma sequência. A tag da lista ordenada \né <ol> e cada item da lista também é indicado pela tag <li>. Veja nas Figuras\n13 e 14 as representações de uma lista ordenada.\nFigura 13. Lista ordenada.\nFigura 14. Exibição de lista ordenada no navegador.\nLista de definição\nUma lista de definição representa uma relação de itens ligados a subitens, \ncomo uma espécie de glossário, porém sem apresentar qualquer marcador. A \ntag da lista de definição é <dl>, cada item da lista é indicado pela tag <dt>\ne seus respectivos subitens são representados pela tag <dd>. Observe as\napresentações de uma lista de definição nas Figura 15 e 16.\nCriação de páginas web com HTML5\n14\n",
            "Figura 15. Lista de definição.\nFigura 16. Exibição de lista de definição no navegador.\nTabelas\nTabelas são utilizadas para exibir um conteúdo tabulado em uma página \nHTML, ou seja, uma tabela formata e apresenta os elementos dispostos em \nlinhas e colunas. Para criar uma tabela você deve usar a tag <table>, seguida \ndas tags que indicam a formação de linha <tr> e coluna <th> e <td> (th\né usado para as colunas do cabeçalho e td, para as demais colunas da tabela) \n(SILVA, 2015).\nTags agrupadoras definem áreas de cabeçalho <thead>, rodapé <tfoot>\ne corpo da tabela <tbody>. Essas tags oferecem a vantagem de organizar e\nseparar as áreas da tabela que podem ser apresentadas de modos diferentes, \n15\nCriação de páginas web com HTML5\n",
            "conforme as folhas de estilo utilizadas, além de permitir que os navegadores \nrepitam os cabeçalhos quando são impressas tabelas com muitas páginas. Veja \nos exemplos das Figura 17 e 18.\nFigura 17. Tabela em HTML5.\nFigura 18. Tabela apresentada no navegador.\nCriação de páginas web com HTML5\n16\n",
            "O exemplo ilustrado apresenta os preços fictícios de alguns veículos em \nforma de tabela de preços. Nesse exemplo, você pode encontrar os principais \nitens de uma tabela, como linhas e colunas e os elementos de estrutura de \ntabelas, como cabeçalho, rodapé e corpo.\nNote que os elementos da estrutura da tabela não precisam, necessariamente, \nestar dispostos em ordem, pois nesse exemplo os itens do rodapé (linhas 6 a \n9) estão inseridos antes do corpo da tabela (linhas 12 a 23) no código-fonte.\nIsso significa que o navegador faz a interpretação dos elementos da tabela e\nos apresenta de forma correta, independentemente da ordem em que foram\nescritos.\nO atributo opcional border (linha 1) define a largura da borda da tabela. Se \nesse atributo for omitido, a tabela será exibida sem bordas, mantendo apenas \na formatação do posicionamento dos elementos. Além desse atributo, outros \ndois podem ser inseridos nas tags <tr> e <td | th>: rowspan e colspan,\nque mesclam linhas e colunas, respectivamente.\nCONSÓRCIO World Wide Web. São Paulo: W3C, c2011. Disponível em: <http://www.\nw3c.br/Home/WebHome>. Acesso em: 30 out. 2017.\nEIS, D.; FERREIRA, E. HTML5 e CSS3: com farinha e pimenta. São Paulo: Lulu.com, 2012.\nFLATSCHART, F. HTML5: embarque imediato. Rio de Janeiro: Brasport, 2011.\nFREEMAN, E.; ROBSON, E. Use a cabeça! Programação em HTML 5. Rio de Janeiro: Alta \nBooks, 2014.\nRIBEIRO, R. Comandos e tags HTML5. Rio de Janeiro: DevMedia, c2017. Disponível em: \n<https://www.devmedia.com.br/comandos-e-tags-html5/23618>. Acesso em: 26 \nnov. 2017.\nSILVA, M. S. Fundamentos de HTML5 e CSS3. São Paulo: Novatec, 2015.\n17\nCriação de páginas web com HTML5\n",
            "Encerra aqui o trecho do livro disponibilizado para \nesta Unidade de Aprendizagem. Na Biblioteca Virtual \nda Instituição, você encontra a obra na íntegra. \n",
            ""
        ],
        "type": "pdf"
    },
    "video": [
        [
            " Olá, seja bem-vindo à dica do professor da unidade de aprendizagem Criação de Pages na Web com HTML5.",
            " Neste vídeo, vamos falar sobre formatação de texto e âncuras em HTML.",
            " A especificação HTML5 disponibiliza uma série de elementos para formatar textos e criar âncuras em páginas web.",
            " Para isso, você deve usar tags específicas, que permitem formatar os elementos visando o equilíbrio do código com a semântica do HTML5.",
            " Nesta dica, criamos uma página HTML que apresenta uma relação de músicas de Roberto Carlos.",
            " Nesta página, montamos um menu de navegação que contém links para algumas páginas do astro.",
            " O objetivo desses links é posicionar a página no início de cada música, sem precisar percorrer todo o documento.",
            " Vejamos agora a estrutura dessa página.",
            " A instrução do type HTML informa o navegador que estamos trabalhando com a versão 5.",
            " Roberto Carlos é o nosso rei, é o título da nossa página. Ele é exibido na barra de título do navegador.",
            " Músicas de Roberto Carlos é o título principal apresentado na nossa página.",
            " Esse destaque se dá através de H2.",
            " Naave é uma tag específica do HTML5.",
            " Ela define uma área da nossa página, onde colocamos os principais links dela.",
            " Section define uma área da nossa página. Nós podemos ter várias sessões na nossa página.",
            " Article é uma área principal da nossa sessão. É nela que vamos colocar as músicas de Roberto Carlos.",
            " Cada música de Roberto Carlos possui um título.",
            " Esse título é destacado com H3, que informa uma letra um pouquinho menor que o título principal da nossa página, que é o H2.",
            " Para apresentar as músicas, utilizamos a tag pré.",
            " Ela define a formatação tal como está digitada na nossa página.",
            " Ela respeita quebras de linha e linhas em branco.",
            " Ao final de cada música, colocamos um atalho para topo.",
            " Esse atalho dá a direcionar a página para o início, onde temos o mesmo indicador topo no título músicas de Roberto Carlos.",
            " Encerramos o fechamento da tag pré e em seguida iniciamos a próxima música.",
            " E é assim por diante até que todas as músicas estejam na nossa página.",
            " Voltando para a nossa página, podemos ver como ela se comporta.",
            " Clicando no início de uma música, percebemos que o navegador posiciona logo no início dela.",
            " No final de cada música, temos o atalho que volta para o início dela.",
            " Podemos navegar entre as músicas e voltar para o início da página. Isso com cada uma delas.",
            " O link de cada música é feito com âncoras, ou seja, são endereços apontados para dentro da própria página.",
            " Nesse caso, como é grande aponta para o início da música como é grande o meu amor por você.",
            " Nesse caso, nós temos esse identificador como é grande com esse título, que aponta para o início dessa música.",
            " E assim encerramos a dica do professor, que tratou sobre formatação de texto e âncoras em HTML.",
            " Espero que você tenha aproveitado essa dica. Bomos estudos!"
        ],
        [
            [
                0.0,
                6.78
            ],
            [
                7.32,
                11.1
            ],
            [
                12.04,
                18.86
            ],
            [
                19.52,
                27.54
            ],
            [
                28.14,
                33.2
            ],
            [
                33.8,
                38.32
            ],
            [
                38.76,
                44.66
            ],
            [
                45.08,
                46.8
            ],
            [
                47.82,
                52.52
            ],
            [
                53.08,
                58.18
            ],
            [
                59.14,
                63.22
            ],
            [
                63.72,
                65.72
            ],
            [
                68.48,
                71.36
            ],
            [
                71.8,
                75.98
            ],
            [
                77.96,
                83.52
            ],
            [
                84.7,
                89.9
            ],
            [
                91.1,
                93.62
            ],
            [
                94.1,
                100.62
            ],
            [
                101.84,
                105.1
            ],
            [
                105.5,
                109.3
            ],
            [
                109.68,
                112.44
            ],
            [
                113.46,
                116.28
            ],
            [
                116.46,
                122.86
            ],
            [
                124.42,
                128.7
            ],
            [
                128.7,
                132.3
            ],
            [
                135.16,
                138.18
            ],
            [
                138.54,
                142.66
            ],
            [
                143.32,
                146.54
            ],
            [
                147.06,
                153.56
            ],
            [
                157.06,
                163.24
            ],
            [
                163.66,
                168.44
            ],
            [
                168.86,
                174.96
            ],
            [
                176.0,
                181.0
            ],
            [
                182.0,
                185.04
            ]
        ]
    ]
}